print()  # рассматривается математическая операция - возведение числа в степень
print(2**0)
print(2**1)
print(2**2)
print(2**3)
print(2 ** (-1))


print()
print(2 ** (-2))
print((-3) ** 3)


# Геометрической прогрессией называется последовательность чисел b1, b2,…,bn​,
# Каждое из которых, начиная с b2​, получается из предыдущего умножением на одно и то же постоянное число q (знаменатель прогрессии).
# Если известен первый член прогрессии и ее знаменатель, то nn-ый член геометрической прогрессии находится по формуле
### Входные данные
# На вход программе подаются три целых числа: b1​, q и n, каждое на отдельной строке.
### Выходные данные
# Программа должна вывести nn-ый член геометрической прогрессии.
print()
print("Укажи чесловое значение которое мы будем расчитывать в прогрессии?")
b1 = int(input())
print("Укажи знаменатель прогресси?")
q = int(input())
print("Укажи число геометрической прогресси?")
n = int(input())
print(b1 * (q ** (n - 1)))
