print()  # рассматривается математическая операция - обычное деление за исключением того, что он отбрасывает десятичную часть результата
print(10 // 3)
print(10 // 4)
print(10 // 5)
print(10 // 6)
print(10 // 12)


print()
print("Напиши сколько самнтиметров у тебя есть - а я посчитаю сколько это в метрах?")
met = int(input())
print("Смотри что получилось:")
print(met // 100)


# Безумный титан Танос собрал все 6 камней бесконечности и намеревается уничтожить половину населения Вселенной по щелчку пальцев.
# При этом если население Вселенной является нечетным числом, то титан проявит милосердие и округлит количество выживших в большую сторону.
# Помогите Мстителям подсчитать количество выживших.
### Формат входных данных
# На вход программе подаётся число целое nn – население Вселенной.
### Формат выходных данных
# Программа должна вывести одно число – количество выживших.
print()
print("Укажи общее количество всех жителей?")
n = int(input())
print("Смотри что получилось:")
print((n + 1) // 2)
