print()  # рассматривается математическая операция - которая возвращает остаток от деления двух целых чисел
print(10 % 3)
print(10 % 4)
print(10 % 5)
print(10 % 6)
print(10 % 12)
print(10 % 20)


# Напишите программу для пересчёта величины временного интервала, заданного в минутах, в величину, выраженную в часах и минутах в следующем формате:
### <исходное кол-во минут> мин - это <полное кол-во часов> час <оставшееся кол-во минут> минут.
### Формат входных данных
# На вход программе подаётся целое число – количество минут.
### Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
### Примечание. Не забывайте точку в конце. 😊
print()
min = int(input())
print(min, "мин - это", min // 60, "час", min % 60, "минут.")
