print()
num = 17
a = num % 10  # вычисляем последнюю цифру числа
b = num // 10  # вычисляем первую цифру числа
print(a)
print(b)


print()
num = 754
a = num % 10  # вычисляем последнюю цифру числа
b = (num % 100) // 10  # вычисляем среднюю цифру числа
c = num // 100  # вычисляем первую цифру числа
print(a)
print(b)
print(c)


print()
num = 123456789
print(num // 1 % 10)
print(num // 10 % 10)
print(num // 100 % 10)
print(num // 1000 % 10)
print(num // 10000 % 10)
print(num // 100000 % 10)
print(num // 1000000 % 10)
print(num // 10000000 % 10)
print(num // 100000000 % 10)


# Напишите программу, определяющую число десятков и единиц в двузначном числе.
print()
num = int(input())
last_digit = num % 10
first_digit = num // 10
print("Число десятков =", first_digit)
print("Число единиц =", last_digit)


# Напишите программу, в которой рассчитывается сумма цифр двузначного числа.
print()
num = int(input())
last_digit = num % 10
first_digit = num // 10
print("Сумма цифр =", last_digit + first_digit)


# Напишите программу, которая печатает число, образованное при перестановке цифр двузначного числа.
print()
num = int(input())
last_digit = num % 10
first_digit = num // 10
print("Искомое число =", last_digit * 10 + first_digit)


# Напишите программу, в которую вводится трехзначное число и которая выводит на экран его цифры (через запятую).
print()
num = int(input())
digit3 = num % 10
digit2 = (num // 10) % 10
digit1 = num // 100
print(digit1, digit2, digit3, sep=",")


### Напишите программу, которая рассчитывает сумму и произведение цифр положительного трёхзначного числа и выводит текст в следующем формате:
# Сумма цифр = <сумма цифр>
# Произведение цифр = <произведение цифр>
### Формат входных данных
# На вход программе подаётся положительное трёхзначное число.
### Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.
# Примечание. Обращайте внимание на лишние пробелы или их отсутствие.
print()
print("Укажи любое трехзначное число?")
num = int(input())
ede = num % 10
des = (num // 10) % 10
sot = num // 100
print("Смотри что получилось:")
print()
print("Сумма цифр =", ede + des + sot)
print("Произведение цифр =", ede * des * sot)


# Дано трехзначное число abc, в котором все цифры различны.
# Напишите программу, которая выводит шесть чисел, образованных при перестановке цифр заданного числа.
print()
print("Укажи любое трехзначное число - например 123")
num = int(input())
print((num // 100 % 10), (num // 10 % 10), (num // 1 % 10), sep="")
print((num // 100 % 10), (num // 1 % 10), (num // 10 % 10), sep="")
print((num // 10 % 10), (num // 100 % 10), (num // 1 % 10), sep="")
print((num // 10 % 10), (num // 1 % 10), (num // 100 % 10), sep="")
print((num // 1 % 10), (num // 100 % 10), (num // 10 % 10), sep="")
print((num // 1 % 10), (num // 10 % 10), (num // 100 % 10), sep="")


# Напишите программу для нахождения цифр четырёхзначного числа.
print()
print("Укажи любое трехзначное число - например 3281")
num = int(input())
print("Цифра в позиции тысяч равна", num // 1000 % 10)
print("Цифра в позиции сотен равна", num // 100 % 10)
print("Цифра в позиции десятков равна", num // 10 % 10)
print("Цифра в позиции единиц равна", num // 1 % 10)
