answer = input("Какой язык программирования мы изучаем? - ")

if answer == "Python":
    print("Верно! Мы ботаем Python =)")
    print("Python - отличный язык!")
else:
    print("Не совсем так!")


print()
print("Какой язык программирования мы изучаем?")
answer = input()
if answer == "Python":
    print("Верно! Мы ботаем Python =)")
    print("Python - отличный язык!")
else:
    print("Не совсем так!")


print("Давай проверим равны твои числа или нет?")
a = int(input())
b = int(input())
c = int(input())
if a == b == c:
    print("числа равны")
else:
    print("числа не равны")


print("Давай проверим равны твои цисла или нет?")
a = int(input())
b = int(input())
c = int(input())
if a != b != c:
    print("числа не равны")
else:
    print("числа равны")


print()
print("Давай проверим какой язык мы изучаем?")
word = input()
if word == "Python":
    print("ДА")
else:
    print("НЕТ")


print()
print("Давай проверим число которое ты введешь состоит из одинаковых цифр - или нет?")
num = int(input())
last_digit = num % 10  # последняя цифра числа
first_digit = num // 10  # первая цифра числа
if last_digit == first_digit:
    print("ДА")
else:
    print("НЕТ")


print()
print("Укажи свой новый пароль")
pass1 = input()
print("Повтори свой новый пароль")
pass2 = input()
if pass1 == pass2:
    print("Пароль принят")
else:
    print("Пароль не принят")


print()
print("Укажи любое число а я проверю и подскажу тебе - Четное оно или Нечетное!")
num = int(input())
if num % 2 == 0:
    print("Четное")
else:
    print("Нечетное")


print()
print("Сколько тебе полных лет?")
age = int(input())
if age < 18:
    print("Доступ запрещен")
else:
    print("Доступ разрешен")


print()
print("Укажи два числа а я сравню из и напишу то которе меньше!")
print("Укажи первое число?")
num1 = int(input())
print("Укажи второе число?")
num2 = int(input())
if num1 < num2:
    print(num1)
else:
    print(num2)


print()
print("Давай проверим последовательность чисел?")
print("Укажи первое число?")
a = int(input())
print("Укажи второе число?")
b = int(input())
print("Укажи третье число?")
c = int(input())
if a < b == (a + 1) < c == (b + 1):
    print("YES")
else:
    print("NO")


print()
print("Давай арифметическую прогрессию чисел?")
print("Укажи первое число?")
a = int(input())
print("Укажи второе число?")
b = int(input())
print("Укажи третье число?")
c = int(input())
if b - a == c - b:
    print("YES")
else:
    print("NO")


# Напишите программу, которая проверяет, что для заданного четырехзначного числа выполняется следующее соотношение: сумма первой и последней цифр равна разности второй и третьей цифр.
# Формат входных данных
# На вход программе подаётся одно целое положительное четырёхзначное число.
# Формат выходных данных
# Программа должна вывести «ДА» (без кавычек), если соотношение выполняется, или «НЕТ» (без кавычек) в противном случае.
print()
print("Давай найдем решение задачи, допустим число - 1614?")
num = int(input())
if (num // 1000 % 10) + (num // 1 % 10) == (num // 100 % 10) - (num // 10 % 10):
    print("ДА")
else:
    print("НЕТ")


# Напишите программу, которая считывает три числа и подсчитывает сумму только положительных чисел.
# Формат входных данных
# На вход программе подаются три целых числа, каждое на отдельной строке.
# Формат выходных данных
# Программа должна вывести одно число – сумму положительных чисел.
# Примечание. Если положительных чисел нет, то следует вывести 00.
print()
print("Давай посчитаем все положительные цифры, укажи например - 4, -22, 1")
print("Укажи первое число?")
num1 = int(input())
print("Укажи второе число?")
num2 = int(input())
print("Укажи третье число?")
num3 = int(input())
summa = 0
if num1 > 0:
    summa = summa + num1
if num2 > 0:
    summa = summa + num2
if num3 > 0:
    summa = summa + num3
print(summa)


print()
print("Давай найдем наименьшее число из всех предложенных - укажи любые 4 числа?")
print("Укажи первое число?")
a = int(input())
print("Укажи второе число?")
b = int(input())
print("Укажи третье число?")
c = int(input())
print("Укажи четвертое число?")
d = int(input())
print(min(a, b, c, d))
