print()  # рассмаривается необязательный именованный параметр - sep разделитель - который по умолчанию равен пробелу
print("aa", "bb", "cc")


print()
print("aa", "bb", "cc", sep=" ")  # обе строки являются эквивалентными


print()
print("aa", "bb", "cc", sep="")  # обе строки являются эквивалентными


print()
print("aa", "bb", "cc", sep="*")  # можно указывать любые значения сепаратора


print()
print("aa", "bb", "cc", sep="х")


print()
minus = "-"
print("aa", "bb", "cc", sep=minus)  # указываем в значении сепаратора переменную
