print()  # рассматривается преобразователь строки в целочисленное выражение - тоесть в число
s = "1992"  # В первом фрагменте переменная s — это строка (string) с символами "1992"
year = int(s)
print(year)


print()
s = 1992  # Во втором s уже является целым числом 1992. Вызов int(s) фактически не меняет значение, так как s уже типа int
year = int(s)
print(year)


print()
print("Укажи первое число")
num1 = input()
print("Укажи второе число")
num2 = input()
print("Смотри что получилось:")
print(
    num1 + num2
)  # Результат будет не тот, потому что Python считает, что в переменных num1 и num2 находится текст


print()
print("Укажи первое число")
num1 = int(input())
print("Укажи второе число")
num2 = int(input())
print("Смотри что получилось:")
print(
    num1 + num2
)  # Видом что результат получелся - желаемый, так как мы через int() преобразовали строку в целое число


print()
print("Укажи любое число - например 8")
num1 = int(input())
num2 = num1 + 1
num3 = num2 + 1
print("Результат работы твоей программы")
print(num1)
print(num2)
print(num3)

print()
print("Укажи первое число")
num1 = int(input())
print("Укажи второе число")
num2 = int(input())
print("Укажи третье число")
num3 = int(input())
print("Смотри что получилось:")
print(num1 + num2 + num3)


print()
print("Укажи первое число")
num1 = int(input())
print("Укажи второе число")
num2 = int(input())
print("Укажи третье число")
num3 = int(input())
print("Укажи четвертое число")
num4 = int(input())
print("Смотри что получилось:")
print((num1 + num2 + num3 + num4) * 3)


# Задание
# ----------- >                3 * (a + b)**3 + 275 * b**2 - 127 * a - 41
# Где - (a + b) в стерени 3
# Где - b в степени 2

print()
print("Укажи первое число")
a = int(input())
print("Укажи второе число")
b = int(input())
print("Смотри что получилось:")
print(3 * (a + b) * (a + b) * (a + b) + 275 * b * b - 127 * a - 41)


print()
print("Укажи любое число - например - 20")
num = int(input())
print("Смотри что получилось:")
print("Следующее за числом", num, "число:", num + 1)
print("Для числа", num, "предыдущее число:", num + -1)


print()
print(
    "Давай расчитаем Обьем куба и Площадь поверхности - укажи любое число - например - 25"
)
num = int(input())
print("Смотри что получилось:")
print("Объем =", num * num * num)
print("Площадь полной поверхности =", 6 * (num * num))


print()
print("Укажи два любых числа - например 2 и 7")
a = int(input())
b = int(input())
print("Смотри что получилось:")
print("число", a, "- число", b, "= сумма чисел", a + b)
print("число", a, "+ число", b, "= разность чисел", a - b)
print("число", a, "* число", b, "= произведение чисел", a * b)


print()
print("Укажи два любых числа - например 2 и 7")
print("Первое число")
a = int(input())
print("Второе число")
b = int(input())
print("Смотри что получилось:")
print(a, "+", b, "=", a + b)
print(a, "-", b, "=", a - b)
print(a, "*", b, "=", a * b)


print()
print("Давай расчитаем раифметическую прогрессию")
print("Укажи первое число - первый член прогрессии")
a1 = int(input())
print("Укажи второе число - разность прогрессии")
d = int(input())
print("Укажи третье число - n-ый член прогрессии")
n = int(input())
print("Смотри что получилось:")
print(a1 + d * (n - 1))


print()
print("Давай расчитаем последовательность чисел - с указанием сепаратора")
num = int(input())
print(num, 2 * num, 3 * num, 4 * num, 5 * num, sep="---")
